---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.PointLightShape
source: html/08235b57-e5a3-f602-6d65-6050a742ff75.htm
---
# PointLightShape Methods

Creates a copy of the LightShape derived object.